{
  "raw_output": "{\n\"Warm Up/Stroking Drills\": {\n\"type\": \"Beginners\",\n\"duration\": 7.5,\n\"drills\": [\n{\n\"name\": \"Forehand-to-forehand, crosscourt, or forehand to backhand, down the line\",\n\"time\": 2.5\n},\n{\n\"name\": \"Backhand-to-backhand, crosscourt, or forehand to backhand, down the line\",\n\"time\": 2.5\n},\n{\n\"name\": \"Forehand-to-forehand pushing, 5 minutes\"\n}\n],\n\"optional_drills\": [\n{\n\"name\": \"See how many forehands and backhands you can hit in a row. Try for 100 or more.\"\n}\n]\n},\n\"type\": \"Intermediate\",\n\"drills\": [\n{\n\"name\": \"Forehand-to-forehand, crosscourt, 2.5 minutes\"\n},\n{\n\"name\": \"Backhand-to-backhand, crosscourt, 2.5 minutes\"\n},\n{\n\"name\": \"Forehand-to-backhand, down the line, 2.5 minutes\"\n}\n],\n\"optional_drills\": [\n{\n\"name\": \"Pushing all over table, all types of pushes\"\n},\n{\n\"name\": \"Backhand loop against block\"\n},\n{\n\"name\": \"Counterlooping\"\n}\n]\n},\n\"type\": \"Advanced\",\n\"drills\": [\n{\n\"name\": \"Forehand-to-forehand crosscourt or forehand to backhand down the line, 2.5 minutes\"\n},\n{\n\"name\": \"Backhand-to-backhand, crosscourt or backhand-to-forehand, down the line, 2.5 minutes\"\n}\n],\n\"optional_drills\": [\n{\n\"name\": \"Serve backspin; partner pushes to your wide backhand; you step around and loop with your forehand to your partner's forehand; he quick-blocks crosscourt to your wide forehand; play out the point.\"\n}\n]\n},\n\"Footwork drills\": {\n\"type\": \"Beginners\",\n\"drills\": [\n{\n\"name\": \"Alternate forehand and backhand shots. You hit all shots to one place on partner's side, either the forehand or backhand side. Partner alternates hitting to your forehand and backhand corners, 5 minutes each\"\n}\n],\n\"optional_drills\": [\n{\n\"name\": \"Figure 8 footwork, you hit every shot crosscourt while your partner hits every shot down the line, 5 minutes each then change direction\"\n}\n]\n},\n\"type\": \"Intermediate\",\n\"drills\": [\n{\n\"name\": \"Side-to-side forehand footwork, all forehands against partner's backhand block to your forehand and backhand courts, 7.5 minutes each\"\n},\n{\n\"name\": \"Partner randomly hits ball either to your forehand or backhand side; you stroke each ball back to the same spot, 5 minutes each\"\n}\n],\n\"optional_drills\": [\n{\n\"name\": \"See Falkenberg drill under 'advanced.' Figure 8 FH footwork - server goes crosscourt, receiver goes down the line with both players only using forehands. 10 minutes total.\"\n}\n]\n},\n\"type\": \"Advanced\",\n\"drills\": [\n{\n\"name\": \"Side-to-side footwork drill, fast, 2/3 to full table covered, 5 minutes each\"\n},\n{\n\"name\": \"2-1 drill (also called Falkenberg drill): You hit all balls to your partner's backhand. He hits two to your backhand, one to your forehand, then repeats. You return first shot with your backhand, step around and hit next with your forehand, then return the next shot (to your wide forehand) with your forehand. 5 minutes each\"\n}\n],\n\"optional_drills\": [\n{\n\"name\": \"Random footwork. Partner hits balls to all parts of the table randomly; you stroke each ball back to the same spot. 5 minutes each\"\n}\n]\n},\n\"Attack drills\": {\n\"type\": \"Beginners\",\n\"drills\": [\n{\n\"name\": \"Serve backspin; partner pushes ball back to specified part of table; you loop, and play out the point. 7.5 minutes each.\"\n}\n],\n\"optional_drills\": [\n{\n\"name\": \"Serve fast & deep to partner's wide backhand, follow up with aggressive forehand or backhand hit or smash\"\n}\n]\n},\n\"type\": \"Intermediate\",\n\"drills\": [\n{\n\"name\": \"Serve short backspin; partner pushes ball back to specified part of table; you loop, and play out the point. 5 minutes each\"\n},\n{\n\"name\": \"Serve short backspin; partner pushes ball back randomly anywhere; you loop (forehand from forehand side, backhand from backhand side), and play out the point. 5 minutes each.\"\n}\n],\n\"optional_drills\": [\n{\n\"name\": \"Serve fast & deep anywhere on the table, follow up with a loop\"\n}\n]\n},\n\"type\": \"Advanced\",\n\"drills\": [\n{\n\"name\": \"Serve short backspin; partner pushes ball back randomly anywhere; you loop (forehand from forehand side, forehand or backhand from backhand side), and play out the point. 7.5 minutes each.\"\n}\n],\n\"optional_drills\": [\n{\n\"name\": \"Server has option of an occasional sudden fast & deep serve to mix things up. Or receiver has option of attacking the serve occasionally.\"\n}\n]\n},\n\"Serve & Receive drills\": {\n\"type\": \"Beginners\",\n\"drills\": [\n{\n\"name\": \"Practice any serve, at least one minute for each serve. This way you not only get to practice and develop the serve, but your partner (and then yourself) gets to practice receiving it. 7.5 minutes each\"\n}\n]\n},\n\"type\": \"Intermediate\",\n\"drills\": [\n{\n\"name\": \"Practice serve and attack. Server can use any serve, but must follow up aggressively. Receiver may attack any deep serves, but should emphasize control. Alternate drill: Server serves one type of serve over and over, receiver is given two options for receive. Server must prepare for both. 7.5 minutes each\"\n}\n],\n\"type\": \"Advanced\",\n\"drills\": [\n{\n\"name\": \"At this point, serve and receive drills get complicated. Advanced players should pick any serve & receive pattern, and practice it. For example, consider all the possible patterns starting with the server serving short backspin, topspin, no-spin, or sidespin. Receiver can push long or short or flip to either side or to the middle. In most drills, receiver should have two possible options, and server must prepare for both.\"\n}\n]\n},\n\"Specialized drills\": {\n\"type\": \"Beginners\",\n\"drills\": [\n{\n\"name\": \"Backhand loop (this can also be done during warm-up).\"\n}\n],\n\"optional_drills\": [\n{\n\"name\": \"Loop/chop drill. Drill is done either all crosscourt or all down the line. You loop; partner blocks; you chop; partner pushes; you loop, and drill repeats.\"\n},\n{\n\"name\": \"Hitting or smashing against block\"\n},\n{\n\"name\": \"Lobbing or chopping\"\n}\n]\n},\n\"type\": \"Intermediate\",\n\"drills\": [\n{\n\"name\": \"Looping against a chopper\"\n}\n],\n\"type\": \"Advanced\",\n\"drills\": [\n{\n\"name\": \"Counterlooping\"\n}\n]\n}\n\n"
}